import cls from "./About.module.scss";
import bannerForAbout from "@/assets/bannerForAbout.png";

const About = () => {
  return (
    <div className={cls.main}>
      <div className={cls.a}>
        <a href="#">
          <p>
            Главная/<span className={cls.sspan}>О нас</span>
          </p>
        </a>
      </div>
      <h1>О нас</h1>
      <div className={cls.aboutAs}>
        <div className={cls.wrapperDescription}>
          <p>
            Добро пожаловать на наш сервис авторских туристических маршрутов по Кыргызстану! Мы предлагаем уникальные путешествия, разработанные местными гидами и энтузиастами. Каждое наше предложение – это больше, чем просто тур: это возможность погрузиться в культуру, природу и традиции нашей удивительной страны.
          </p>
          <p>
            Наши маршруты созданы для тех, кто ищет аутентичные впечатления и хочет открыть для себя неизведанные уголки Кыргызстана. Мы заботимся о вашем комфорте и безопасности, организуя поездки, которые соединяют природу, культуру и приключения.
          </p>
          <p>
            Присоединяйтесь к нам и создайте незабываемые воспоминания в одном из самых живописных уголков мира!
          </p>
        </div>
        <img src={bannerForAbout.src} alt="bannerForAbout" />
      </div>
      <div className={cls.license}>
        <h2>Лицензии</h2>
        <p>
          Материалы сайта TravelTok лицензированы через что-то, что подразумевает под собой возможность использования материалов сайта лишь в некоммерческих целях и со ссылкой на источник.
        </p>
      </div>
      <div className={cls.sliderAdvantages}>
        <div className={cls.advantagesItem}>
          <h3>Необычные экскурсии</h3>
          <p>
            Мы любим необычные экскурсии: вы не только узнаете историю города, но и погуляете по его секретным барам, крышам и галереям современного искусства. А еще приготовите обед с местным шеф-поваром.
          </p>
        </div>
        <div className={cls.advantagesItem}>
          <h3>Увлеченные гиды</h3>
          <p>
            Наши экскурсии проводят увлеченные, общительные люди с большим багажом знаний: историки, архитекторы, журналисты, искусствоведы и другие эксперты.
          </p>
        </div>
        <div className={cls.advantagesItem}>
          <h3>Личное общение</h3>
          <p>
            Вся магия и яркие впечатления рождаются в личном общении, поэтому мы специально заботимся о качестве экскурсий. Вы не найдете у нас гидов со скучными заученными программами.
          </p>
        </div>
      </div>
    </div>
  );
};

export default About;
