"use client";
import { useState } from "react";
import cls from "./Accordion.module.scss";
import { TfiPlus } from "react-icons/tfi";
import { TfiMinus } from "react-icons/tfi";


interface AccordionItemProps {
  question: string;
  answer: string;
}

const AccordionItem: React.FC<AccordionItemProps> = ({ question, answer }) => {
  const [isOpen, setIsOpen] = useState(false);

  const toggleAccordion = () => {
    setIsOpen(!isOpen);
  };

  return (
    <div className={cls.accordionItem}>
      <div className={cls.question} onClick={toggleAccordion}>
        <h3>{question}</h3>
        <span>{isOpen ? <TfiPlus /> : <TfiMinus />}</span>
      </div>
      {isOpen && <div className={cls.answer}><p>{answer}</p></div>}
    </div>
  );
};

const Accordion: React.FC = () => {
  const faqData: AccordionItemProps[] = [
    { question: "Какие активности можно совершить на лугах Кыргызстана?", answer: "На лугах Кыргызстана можно насладиться пешими прогулками и походами, устраивать пикники, наблюдать за местной флорой и фауной, а также познакомиться с кочевыми традициями страны, увидев стада овец и юрты. Луга — идеальное место для спокойного отдыха на природе." },
    { question: "Чем знамениты горы Кыргызстана?", answer: "Горы Кыргызстана, в частности, Тянь-Шань и Памир, знамениты своими величественными пейзажами и высочайшими вершинами, такими как пик Победы (7439 м) и пик Ленина (7134 м). Они привлекают альпинистов, треккеров и любителей приключений со всего мира. Горы известны своей уникальной природой, ледниками, дикой природой и прекрасными возможностями для активного отдыха — от горных походов до катания на лыжах." },
    { question: "Какое озеро в Кыргызстане самое популярное среди туристов?", answer: "Озеро Иссык-Куль — самое популярное озеро в Кыргызстане среди туристов. Оно является вторым по величине горным озером в мире и известно своей чистой и солоноватой водой. Иссык-Куль окружен горными хребтами, что делает его не только прекрасным местом для пляжного отдыха, но и для треккинга, велопоходов и водных видов спорта. Оно также является круглогодичным курортом, поскольку даже зимой здесь мягкий климат." },
    { question: "Какие виды отдыха можно найти на реках Кыргызстана?", answer: "На реках Кыргызстана можно найти различные виды активного отдыха, такие как рафтинг, каякинг и рыбалка. Например, река Чу и ее притоки предоставляют отличные условия для сплавов на рафтах, особенно для тех, кто любит экстремальные водные виды спорта. Рыбалка также популярна на многих реках, особенно на таких как Нарын и Сары-Джаз, которые богаты форелью и другими видами рыбы." },
    { question: "Когда лучше всего посещать озера и реки Кыргызстана?", answer: "Лучшее время для посещения озер и рек Кыргызстана — это лето, с июня по сентябрь. В это время погода теплая, что делает купание в озерах и сплавы по рекам особенно приятными. Кроме того, дороги к удаленным горным озерам и рекам становятся доступнее. Осенью, в сентябре и октябре, также приятно посетить регионы, так как туристов становится меньше, а природа покрывается золотыми осенними красками." },
  ];

  return (
    <div className={cls.accordion}>
      {faqData.map((item, index) => (
        <AccordionItem key={index} question={item.question} answer={item.answer} />
      ))}
    </div>
  );
};

export default Accordion;
